runs/flight__arm_b_spring__null-agent__t1__rep1__20260611T132051Z/logs/k6.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /Users/ggalazzo/workspace/personal/recq-rigor-study/perf/flight/workload.js
        output: -

     scenarios: (100.00%) 2 scenarios, 25 max VUs, 2m40s max duration (incl. graceful stop):
              * warmup: 5 looping VUs for 30s (gracefulStop: 5s)
              * load: 20 looping VUs for 2m0s (startTime: 30s, gracefulStop: 10s)


running (0m01.0s), 05/25 VUs, 45 complete and 0 interrupted iterations
warmup   [   3% ] 5 VUs    01.0s/30s
load   • [   0% ] waiting  29.0s

running (0m02.0s), 05/25 VUs, 90 complete and 0 interrupted iterations
warmup   [   7% ] 5 VUs    02.0s/30s
load   • [   0% ] waiting  28.0s

running (0m03.0s), 05/25 VUs, 140 complete and 0 interrupted iterations
warmup   [  10% ] 5 VUs    03.0s/30s
load   • [   0% ] waiting  27.0s

running (0m04.0s), 05/25 VUs, 185 complete and 0 interrupted iterations
warmup   [  13% ] 5 VUs    04.0s/30s
load   • [   0% ] waiting  26.0s

running (0m05.0s), 05/25 VUs, 230 complete and 0 interrupted iterations
warmup   [  17% ] 5 VUs    05.0s/30s
load   • [   0% ] waiting  25.0s

running (0m06.0s), 05/25 VUs, 280 complete and 0 interrupted iterations
warmup   [  20% ] 5 VUs    06.0s/30s
load   • [   0% ] waiting  24.0s

running (0m07.0s), 05/25 VUs, 320 complete and 0 interrupted iterations
warmup   [  23% ] 5 VUs    07.0s/30s
load   • [   0% ] waiting  23.0s

running (0m08.0s), 05/25 VUs, 370 complete and 0 interrupted iterations
warmup   [  27% ] 5 VUs    08.0s/30s
load   • [   0% ] waiting  22.0s

running (0m09.0s), 05/25 VUs, 415 complete and 0 interrupted iterations
warmup   [  30% ] 5 VUs    09.0s/30s
load   • [   0% ] waiting  21.0s

running (0m10.0s), 05/25 VUs, 465 complete and 0 interrupted iterations
warmup   [  33% ] 5 VUs    10.0s/30s
load   • [   0% ] waiting  20.0s

running (0m11.0s), 05/25 VUs, 510 complete and 0 interrupted iterations
warmup   [  37% ] 5 VUs    11.0s/30s
load   • [   0% ] waiting  19.0s

running (0m12.0s), 05/25 VUs, 560 complete and 0 interrupted iterations
warmup   [  40% ] 5 VUs    12.0s/30s
load   • [   0% ] waiting  18.0s

running (0m13.0s), 05/25 VUs, 605 complete and 0 interrupted iterations
warmup   [  43% ] 5 VUs    13.0s/30s
load   • [   0% ] waiting  17.0s

running (0m14.0s), 05/25 VUs, 650 complete and 0 interrupted iterations
warmup   [  47% ] 5 VUs    14.0s/30s
load   • [   0% ] waiting  16.0s

running (0m15.0s), 05/25 VUs, 700 complete and 0 interrupted iterations
warmup   [  50% ] 5 VUs    15.0s/30s
load   • [   0% ] waiting  15.0s

running (0m16.0s), 05/25 VUs, 745 complete and 0 interrupted iterations
warmup   [  53% ] 5 VUs    16.0s/30s
load   • [   0% ] waiting  14.0s

running (0m17.0s), 05/25 VUs, 790 complete and 0 interrupted iterations
warmup   [  57% ] 5 VUs    17.0s/30s
load   • [   0% ] waiting  13.0s

running (0m18.0s), 05/25 VUs, 840 complete and 0 interrupted iterations
warmup   [  60% ] 5 VUs    18.0s/30s
load   • [   0% ] waiting  12.0s

running (0m19.0s), 05/25 VUs, 885 complete and 0 interrupted iterations
warmup   [  63% ] 5 VUs    19.0s/30s
load   • [   0% ] waiting  11.0s

running (0m20.0s), 05/25 VUs, 935 complete and 0 interrupted iterations
warmup   [  67% ] 5 VUs    20.0s/30s
load   • [   0% ] waiting  10.0s

running (0m21.0s), 05/25 VUs, 980 complete and 0 interrupted iterations
warmup   [  70% ] 5 VUs    21.0s/30s
load   • [   0% ] waiting  09.0s

running (0m22.0s), 05/25 VUs, 1030 complete and 0 interrupted iterations
warmup   [  73% ] 5 VUs    22.0s/30s
load   • [   0% ] waiting  08.0s

running (0m23.0s), 05/25 VUs, 1075 complete and 0 interrupted iterations
warmup   [  77% ] 5 VUs    23.0s/30s
load   • [   0% ] waiting  07.0s

running (0m24.0s), 05/25 VUs, 1125 complete and 0 interrupted iterations
warmup   [  80% ] 5 VUs    24.0s/30s
load   • [   0% ] waiting  06.0s

running (0m25.0s), 05/25 VUs, 1170 complete and 0 interrupted iterations
warmup   [  83% ] 5 VUs    25.0s/30s
load   • [   0% ] waiting  05.0s

running (0m26.0s), 05/25 VUs, 1215 complete and 0 interrupted iterations
warmup   [  87% ] 5 VUs    26.0s/30s
load   • [   0% ] waiting  04.0s

running (0m27.0s), 05/25 VUs, 1265 complete and 0 interrupted iterations
warmup   [  90% ] 5 VUs    27.0s/30s
load   • [   0% ] waiting  03.0s

running (0m28.0s), 05/25 VUs, 1310 complete and 0 interrupted iterations
warmup   [  93% ] 5 VUs    28.0s/30s
load   • [   0% ] waiting  02.0s

running (0m29.0s), 05/25 VUs, 1355 complete and 0 interrupted iterations
warmup   [  97% ] 5 VUs    29.0s/30s
load   • [   0% ] waiting  01.0s

running (0m30.0s), 05/25 VUs, 1405 complete and 0 interrupted iterations
warmup   [ 100% ] 5 VUs    30.0s/30s
load   • [   0% ] waiting  00.0s

running (0m31.0s), 20/25 VUs, 1590 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [   1% ] 20 VUs  0m01.0s/2m0s

running (0m32.0s), 20/25 VUs, 1770 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [   2% ] 20 VUs  0m02.0s/2m0s

running (0m33.0s), 20/25 VUs, 1970 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [   2% ] 20 VUs  0m03.0s/2m0s

running (0m34.0s), 20/25 VUs, 2150 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [   3% ] 20 VUs  0m04.0s/2m0s

running (0m35.0s), 20/25 VUs, 2350 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [   4% ] 20 VUs  0m05.0s/2m0s

running (0m36.0s), 20/25 VUs, 2530 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [   5% ] 20 VUs  0m06.0s/2m0s

running (0m37.0s), 20/25 VUs, 2730 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [   6% ] 20 VUs  0m07.0s/2m0s

running (0m38.0s), 20/25 VUs, 2910 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [   7% ] 20 VUs  0m08.0s/2m0s

running (0m39.0s), 20/25 VUs, 3110 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [   7% ] 20 VUs  0m09.0s/2m0s

running (0m40.0s), 20/25 VUs, 3290 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [   8% ] 20 VUs  0m10.0s/2m0s

running (0m41.0s), 20/25 VUs, 3490 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [   9% ] 20 VUs  0m11.0s/2m0s

running (0m42.0s), 20/25 VUs, 3670 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  10% ] 20 VUs  0m12.0s/2m0s

running (0m43.0s), 20/25 VUs, 3870 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  11% ] 20 VUs  0m13.0s/2m0s

running (0m44.0s), 20/25 VUs, 4050 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  12% ] 20 VUs  0m14.0s/2m0s

running (0m45.0s), 20/25 VUs, 4250 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  12% ] 20 VUs  0m15.0s/2m0s

running (0m46.0s), 20/25 VUs, 4430 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  13% ] 20 VUs  0m16.0s/2m0s

running (0m47.0s), 20/25 VUs, 4610 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  14% ] 20 VUs  0m17.0s/2m0s

running (0m48.0s), 20/25 VUs, 4810 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  15% ] 20 VUs  0m18.0s/2m0s

running (0m49.0s), 20/25 VUs, 4990 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  16% ] 20 VUs  0m19.0s/2m0s

running (0m50.0s), 20/25 VUs, 5170 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  17% ] 20 VUs  0m20.0s/2m0s

running (0m51.0s), 20/25 VUs, 5370 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  17% ] 20 VUs  0m21.0s/2m0s

running (0m52.0s), 20/25 VUs, 5556 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  18% ] 20 VUs  0m22.0s/2m0s

running (0m53.0s), 20/25 VUs, 5751 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  19% ] 20 VUs  0m23.0s/2m0s

running (0m54.0s), 20/25 VUs, 5950 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  20% ] 20 VUs  0m24.0s/2m0s

running (0m55.0s), 20/25 VUs, 6131 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  21% ] 20 VUs  0m25.0s/2m0s

running (0m56.0s), 20/25 VUs, 6331 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  22% ] 20 VUs  0m26.0s/2m0s

running (0m57.0s), 20/25 VUs, 6511 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  22% ] 20 VUs  0m27.0s/2m0s

running (0m58.0s), 20/25 VUs, 6711 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  23% ] 20 VUs  0m28.0s/2m0s

running (0m59.0s), 20/25 VUs, 6891 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  24% ] 20 VUs  0m29.0s/2m0s

running (1m00.0s), 20/25 VUs, 7091 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  25% ] 20 VUs  0m30.0s/2m0s

running (1m01.0s), 20/25 VUs, 7271 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  26% ] 20 VUs  0m31.0s/2m0s

running (1m02.0s), 20/25 VUs, 7471 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  27% ] 20 VUs  0m32.0s/2m0s

running (1m03.0s), 20/25 VUs, 7651 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  27% ] 20 VUs  0m33.0s/2m0s

running (1m04.0s), 20/25 VUs, 7851 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  28% ] 20 VUs  0m34.0s/2m0s

running (1m05.0s), 20/25 VUs, 8031 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  29% ] 20 VUs  0m35.0s/2m0s

running (1m06.0s), 20/25 VUs, 8231 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  30% ] 20 VUs  0m36.0s/2m0s

running (1m07.0s), 20/25 VUs, 8411 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  31% ] 20 VUs  0m37.0s/2m0s

running (1m08.0s), 20/25 VUs, 8591 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  32% ] 20 VUs  0m38.0s/2m0s

running (1m09.0s), 20/25 VUs, 8791 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  32% ] 20 VUs  0m39.0s/2m0s

running (1m10.0s), 20/25 VUs, 8971 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  33% ] 20 VUs  0m40.0s/2m0s

running (1m11.0s), 20/25 VUs, 9171 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  34% ] 20 VUs  0m41.0s/2m0s

running (1m12.0s), 20/25 VUs, 9351 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  35% ] 20 VUs  0m42.0s/2m0s

running (1m13.0s), 20/25 VUs, 9551 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  36% ] 20 VUs  0m43.0s/2m0s

running (1m14.0s), 20/25 VUs, 9733 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  37% ] 20 VUs  0m44.0s/2m0s

running (1m15.0s), 20/25 VUs, 9915 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  37% ] 20 VUs  0m45.0s/2m0s

running (1m16.0s), 20/25 VUs, 10113 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  38% ] 20 VUs  0m46.0s/2m0s

running (1m17.0s), 20/25 VUs, 10295 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  39% ] 20 VUs  0m47.0s/2m0s

running (1m18.0s), 20/25 VUs, 10493 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  40% ] 20 VUs  0m48.0s/2m0s

running (1m19.0s), 20/25 VUs, 10675 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  41% ] 20 VUs  0m49.0s/2m0s

running (1m20.0s), 20/25 VUs, 10873 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  42% ] 20 VUs  0m50.0s/2m0s

running (1m21.0s), 20/25 VUs, 11055 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  42% ] 20 VUs  0m51.0s/2m0s

running (1m22.0s), 20/25 VUs, 11235 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  43% ] 20 VUs  0m52.0s/2m0s

running (1m23.0s), 20/25 VUs, 11435 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  44% ] 20 VUs  0m53.0s/2m0s

running (1m24.0s), 20/25 VUs, 11615 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  45% ] 20 VUs  0m54.0s/2m0s

running (1m25.0s), 20/25 VUs, 11810 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  46% ] 20 VUs  0m55.0s/2m0s

running (1m26.0s), 20/25 VUs, 11995 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  47% ] 20 VUs  0m56.0s/2m0s

running (1m27.0s), 20/25 VUs, 12175 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  47% ] 20 VUs  0m57.0s/2m0s

running (1m28.0s), 20/25 VUs, 12375 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  48% ] 20 VUs  0m58.0s/2m0s

running (1m29.0s), 20/25 VUs, 12555 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  49% ] 20 VUs  0m59.0s/2m0s

running (1m30.0s), 20/25 VUs, 12735 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  50% ] 20 VUs  1m00.0s/2m0s

running (1m31.0s), 20/25 VUs, 12935 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  51% ] 20 VUs  1m01.0s/2m0s

running (1m32.0s), 20/25 VUs, 13115 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  52% ] 20 VUs  1m02.0s/2m0s

running (1m33.0s), 20/25 VUs, 13315 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  52% ] 20 VUs  1m03.0s/2m0s

running (1m34.0s), 20/25 VUs, 13495 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  53% ] 20 VUs  1m04.0s/2m0s

running (1m35.0s), 20/25 VUs, 13695 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  54% ] 20 VUs  1m05.0s/2m0s

running (1m36.0s), 20/25 VUs, 13875 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  55% ] 20 VUs  1m06.0s/2m0s

running (1m37.0s), 20/25 VUs, 14055 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  56% ] 20 VUs  1m07.0s/2m0s

running (1m38.0s), 20/25 VUs, 14255 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  57% ] 20 VUs  1m08.0s/2m0s

running (1m39.0s), 20/25 VUs, 14435 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  57% ] 20 VUs  1m09.0s/2m0s

running (1m40.0s), 20/25 VUs, 14635 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  58% ] 20 VUs  1m10.0s/2m0s

running (1m41.0s), 20/25 VUs, 14815 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  59% ] 20 VUs  1m11.0s/2m0s

running (1m42.0s), 20/25 VUs, 14995 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  60% ] 20 VUs  1m12.0s/2m0s

running (1m43.0s), 20/25 VUs, 15195 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  61% ] 20 VUs  1m13.0s/2m0s

running (1m44.0s), 20/25 VUs, 15375 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  62% ] 20 VUs  1m14.0s/2m0s

running (1m45.0s), 20/25 VUs, 15555 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  62% ] 20 VUs  1m15.0s/2m0s

running (1m46.0s), 20/25 VUs, 15755 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  63% ] 20 VUs  1m16.0s/2m0s

running (1m47.0s), 20/25 VUs, 15935 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  64% ] 20 VUs  1m17.0s/2m0s

running (1m48.0s), 20/25 VUs, 16135 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  65% ] 20 VUs  1m18.0s/2m0s

running (1m49.0s), 20/25 VUs, 16315 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  66% ] 20 VUs  1m19.0s/2m0s

running (1m50.0s), 20/25 VUs, 16515 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  67% ] 20 VUs  1m20.0s/2m0s

running (1m51.0s), 20/25 VUs, 16695 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  67% ] 20 VUs  1m21.0s/2m0s

running (1m52.0s), 20/25 VUs, 16895 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  68% ] 20 VUs  1m22.0s/2m0s

running (1m53.0s), 20/25 VUs, 17075 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  69% ] 20 VUs  1m23.0s/2m0s

running (1m54.0s), 20/25 VUs, 17255 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  70% ] 20 VUs  1m24.0s/2m0s

running (1m55.0s), 20/25 VUs, 17455 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  71% ] 20 VUs  1m25.0s/2m0s

running (1m56.0s), 20/25 VUs, 17635 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  72% ] 20 VUs  1m26.0s/2m0s

running (1m57.0s), 20/25 VUs, 17815 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  72% ] 20 VUs  1m27.0s/2m0s

running (1m58.0s), 20/25 VUs, 18015 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  73% ] 20 VUs  1m28.0s/2m0s

running (1m59.0s), 20/25 VUs, 18196 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  74% ] 20 VUs  1m29.0s/2m0s

running (2m00.0s), 20/25 VUs, 18388 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  75% ] 20 VUs  1m30.0s/2m0s

running (2m01.0s), 20/25 VUs, 18576 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  76% ] 20 VUs  1m31.0s/2m0s

running (2m02.0s), 20/25 VUs, 18756 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  77% ] 20 VUs  1m32.0s/2m0s

running (2m03.0s), 20/25 VUs, 18956 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  77% ] 20 VUs  1m33.0s/2m0s

running (2m04.0s), 20/25 VUs, 19136 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  78% ] 20 VUs  1m34.0s/2m0s

running (2m05.0s), 20/25 VUs, 19336 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  79% ] 20 VUs  1m35.0s/2m0s

running (2m06.0s), 20/25 VUs, 19516 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  80% ] 20 VUs  1m36.0s/2m0s

running (2m07.0s), 20/25 VUs, 19696 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  81% ] 20 VUs  1m37.0s/2m0s

running (2m08.0s), 20/25 VUs, 19896 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  82% ] 20 VUs  1m38.0s/2m0s

running (2m09.0s), 20/25 VUs, 20076 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  82% ] 20 VUs  1m39.0s/2m0s

running (2m10.0s), 20/25 VUs, 20256 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  83% ] 20 VUs  1m40.0s/2m0s

running (2m11.0s), 20/25 VUs, 20456 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  84% ] 20 VUs  1m41.0s/2m0s

running (2m12.0s), 20/25 VUs, 20636 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  85% ] 20 VUs  1m42.0s/2m0s

running (2m13.0s), 20/25 VUs, 20836 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  86% ] 20 VUs  1m43.0s/2m0s

running (2m14.0s), 20/25 VUs, 21016 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  87% ] 20 VUs  1m44.0s/2m0s

running (2m15.0s), 20/25 VUs, 21216 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  87% ] 20 VUs  1m45.0s/2m0s

running (2m16.0s), 20/25 VUs, 21396 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  88% ] 20 VUs  1m46.0s/2m0s

running (2m17.0s), 20/25 VUs, 21576 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  89% ] 20 VUs  1m47.0s/2m0s

running (2m18.0s), 20/25 VUs, 21776 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  90% ] 20 VUs  1m48.0s/2m0s

running (2m19.0s), 20/25 VUs, 21956 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  91% ] 20 VUs  1m49.0s/2m0s

running (2m20.0s), 20/25 VUs, 22156 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  92% ] 20 VUs  1m50.0s/2m0s

running (2m21.0s), 20/25 VUs, 22336 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  92% ] 20 VUs  1m51.0s/2m0s

running (2m22.0s), 20/25 VUs, 22516 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  93% ] 20 VUs  1m52.0s/2m0s

running (2m23.0s), 20/25 VUs, 22716 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  94% ] 20 VUs  1m53.0s/2m0s

running (2m24.0s), 20/25 VUs, 22896 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  95% ] 20 VUs  1m54.0s/2m0s

running (2m25.0s), 20/25 VUs, 23096 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  96% ] 20 VUs  1m55.0s/2m0s

running (2m26.0s), 20/25 VUs, 23276 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  97% ] 20 VUs  1m56.0s/2m0s

running (2m27.0s), 20/25 VUs, 23476 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  97% ] 20 VUs  1m57.0s/2m0s

running (2m28.0s), 20/25 VUs, 23656 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  98% ] 20 VUs  1m58.0s/2m0s

running (2m29.0s), 20/25 VUs, 23846 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  99% ] 20 VUs  1m59.0s/2m0s

running (2m30.0s), 20/25 VUs, 24036 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [ 100% ] 20 VUs  2m00.0s/2m0s


  █ THRESHOLDS 

    http_req_duration{endpoint:book_seat,phase:load}
    ✓ 'p(95)<2000' p(95)=7.79ms

    http_req_duration{endpoint:get_booking,phase:load}
    ✓ 'p(95)<1000' p(95)=0s

    http_req_duration{endpoint:get_flight,phase:load}
    ✓ 'p(95)<1000' p(95)=8.24ms

    http_req_duration{endpoint:get_stats,phase:load}
    ✓ 'p(95)<1000' p(95)=7.84ms


  █ TOTAL RESULTS 

    checks_total.......: 24056   160.304446/s
    checks_succeeded...: 0.00%   0 out of 24056
    checks_failed......: 100.00% 24056 out of 24056

    ✗ flight readable
      ↳  0% — ✓ 0 / ✗ 12003
    ✗ booking accepted
      ↳  0% — ✓ 0 / ✗ 9591
    ✗ stats readable
      ↳  0% — ✓ 0 / ✗ 2462

    HTTP
    http_req_duration.......................: avg=3.76ms   min=205µs    med=3.36ms   max=70.43ms  p(90)=6.51ms  p(95)=8.15ms  
      { endpoint:book_seat,phase:load }.....: avg=3.6ms    min=245µs    med=3.25ms   max=49.73ms  p(90)=6.27ms  p(95)=7.79ms  
      { endpoint:get_booking,phase:load }...: avg=0s       min=0s       med=0s       max=0s       p(90)=0s      p(95)=0s      
      { endpoint:get_flight,phase:load }....: avg=3.8ms    min=205µs    med=3.39ms   max=49.51ms  p(90)=6.54ms  p(95)=8.24ms  
      { endpoint:get_stats,phase:load }.....: avg=3.69ms   min=242µs    med=3.36ms   max=44.2ms   p(90)=6.4ms   p(95)=7.84ms  
    http_req_failed.........................: 100.00% 24058 out of 24058
    http_reqs...............................: 24058   160.317774/s

    EXECUTION
    iteration_duration......................: avg=106.02ms min=100.25ms med=105.31ms max=174.36ms p(90)=110.6ms p(95)=112.83ms
    iterations..............................: 24056   160.304446/s
    vus.....................................: 20      min=5              max=20
    vus_max.................................: 25      min=25             max=25

    NETWORK
    data_received...........................: 7.6 MB  51 kB/s
    data_sent...............................: 3.6 MB  24 kB/s



running (2m30.1s), 00/25 VUs, 24056 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load   ✓ [ 100% ] 20 VUs  2m0s

--- stderr ---